frontend/controllers/SiteController.php

SELECT * FROM `tb_user` WHERE `id`='8'
---
    public function actionHome()
    {
        /*
         * 调试默认登陆一个用户*/
        $userId = 7;
        $userObj = User::findOne($userId);