frontend/controllers/UserController.php

    public function actionInfo()
    {
        $userId = yii::$app->user->id;
        $userObj = User::findOne($userId);
---
SELECT * FROM `tb_user` WHERE `id`=8