common/models/BaseGlobal.php

INSERT INTO `tb_base_global` (`name`, `value`, `update_time`) VALUES ('accesstoken', 'f-aehoxkar7kC4gTrYdEptuxrlFBdSL6zyFmjE2TdGKcjdcwidf0z1uvh1Zo4SlVGnRd4RFfjEPrgVxetUIH_UND1VD-JOnU4TDL3_KSM2B6CGwvS4UVpq3EFbQtTknSZBJeAAARTB', 1471584093)
---
    public static function addBaseGlobal($name,$value)
    {
        $obj = new BaseGlobal();
        $obj->name = $name;
        $obj->value = $value;
        $obj->update_time = time();
        if($obj->save()){

SELECT * FROM `tb_base_global` WHERE `name`='accesstoken'
UPDATE `tb_base_global` SET `value`='84I4NI9BaQhW1eXiq8vXMZZpLkh9gi-Qt27mK-xtwKKLdkAT-QHE5RX0nzNjh0uV_yJbHVZgziJzQTukuGuGW73lshNqnJe2jh5YYB_25iNMXkPMuMzYvUcby8klZVuCPNXhADASQA', `update_time`=1471589340 WHERE `name`='accesstoken'
---
    public static function updateBaseGlobal($name,$value)
    {
        $obj = BaseGlobal::findOne(['name'=>$name]);
        $obj->value = $value;
        $obj->update_time = time();
        if($obj->save()){

SELECT * FROM `tb_base_global` WHERE `name`='accesstoken'
---
    public static function getWxAccessToken()
    {
        $appid = yii::$app->params['APP_ID'];
        $secret = yii::$app->params['APP_SECRET'];

        $rs = BaseGlobal::findOne(["name" => yii::$app->params['GLOBAL_WX_ACCESTOKEN_NAME'] ]);