common/models/User.php

SELECT * FROM `tb_user` WHERE (`id`=8) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `tb_user` WHERE (`login_type_id`='o2W1lwqqKRE2B-VMTLxShoJuItVs') AND (`login_type`=1) AND (`status`=10)
SELECT * FROM `user` WHERE (`login_type_id`='o2W1lwq5EFgllSxFn7Ff0DGNBQqc') AND (`login_type`=1) AND (`status`=10)
---
    public static function getUserByWxid($openid)
    {
        return static::findOne(['login_type_id' => $openid,'login_type'=>yii::$app->params['LOGIN_TYPE_WX'], 'status' => self::STATUS_ACTIVE]);

INSERT INTO `tb_user` (`login_type`, `login_type_id`, `username`, `sex`, `province`, `headimgurl`, `last_ip`, `created_at`, `updated_at`, `password_hash`, `auth_key`, `status`) VALUES (1, 'o2W1lwqqKRE2B-VMTLxShoJuItVs', 'W. X.', 2, '江苏', 'http://wx.qlogo.cn/mmopen/PiajxSqBRaEJRxtvVsKHuWzl6hH2G8wzF6nOSU7TBRGGb0SqqCh2ywAjOFAxLYf7ibuFMwITLM3niahZqXVW21GNQ/0', '218.1.125.205', 1471589341, 1471589341, '$2y$13$0DcBYtjd6.E9BIzSQouZhuBSSXJed5mbyP44nw6kl/sM/T5y1MWg.', '-r3nYMW1aC6yIHBAZ3Ds7_wtm7bHry-v', 10)
---
    public static function addWxUser($wxInfo_obj)
    {
        $user = new User();
        $user->login_type = yii::$app->params['LOGIN_TYPE_WX'];
        $user->login_type_id = $wxInfo_obj['openid'];
        $user->username = $wxInfo_obj['nickname'];
        $user->sex = $wxInfo_obj['sex'];
        $user->province = $wxInfo_obj['province'];
        $user->wx_imgurl = $wxInfo_obj['headimgurl'];
        $user->last_ip = tool::getIp();
        $user->created_at = time();
        $user->updated_at = time();
        $user->setPassword("123456");
        $user->generateAuthKey();

        if($user->save()){